/**
  * @file       bsp.c
  * @brief      硬件底层驱动库
  * @author     redoc <619675912@qq.com>
  * @version    v1.0
  * @date       2017-08-07
  *
  * @note
  * [2016-08-07] <redoc> v1.0
  * 初始版本
  *
  * @remark
  */
/* Includes ------------------------------------------------------------------*/
#include "bsp.h"
#include "tim.h"
#include "gpio.h"


/* typedef -----------------------------------------------------------*/
/* define ------------------------------------------------------------*/
/* macro -------------------------------------------------------------*/
/* variables ---------------------------------------------------------*/
/* function prototypes -----------------------------------------------*/
/* functions ---------------------------------------------------------*/

/**
  * @brief  硬件库初始化
  * @param  void
  *
  * @return void
  * @remark
  */
void BSP_Init(void)
{
    MX_TIM3_Init();
    MX_GPIO_Init();
}



